# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.


a: int = 2
b: float = 42.2
str = 'text'
bl: bool = True
ls = list()
print(type(a), type(b), type(str), type(bl), type(ls), sep='\n')